In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [4]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [ ]:
"""
pickle : 파이썬 객체를 파일로 저장(텍스트로 저장하지 않음)
 텍스트수집 -> 정제 -> 분석 -> 시각화 -> (모델링) -> 유지보수
ex) 10기가바이트(raw text)-> parsing -> 분석 대상 텍스트만 추출 -> dict/list 등에 저장
pickle 모듈 : 파이썬 객체(dict, list, df, ser...)에 저장된 정제된 텍스트를 바이너리 형식으로 파일에 저장
(속도 매우 빠름, 용량 작음)
"""
#정제된 텍스트 ={'대한민국':100, '우리나라':50, ...}

In [5]:
import pickle

In [6]:
myList=['a','b']

In [7]:
with open("pic_ex1.pickle","wb") as f:
    pickle.dump(myList, f)

In [8]:
with open("pic_ex1.pickle","rb") as f:
    myData=pickle.load(f)

In [9]:
myData

['a', 'b']

In [11]:
price=pd.read_pickle("data/examples/yahoo_price.pkl")
price
volume=pd.read_pickle("data/examples/yahoo_volume.pkl")
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [12]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [13]:
volume.to_pickle("pic_ex2.pkl")

In [14]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [15]:
returns=price.pct_change() # (현재행-이전행)/현재행
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [16]:
#다음주 월요일(분산, 공분산, 상관계수(분석))
returns['AAPL'].corr(returns['GOOG'])

0.4079185761679698

In [17]:
returns['AAPL'].corr(returns['IBM'])

0.3868174361139097

In [18]:
returns['AAPL'].corr(returns['MSFT'])

0.38969458628057846

In [19]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [20]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [21]:
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [22]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [23]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [24]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [25]:
obj.value_counts() #시리즈.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [27]:
obj.to_numpy() #시리즈 -> 넘파이 배열

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [28]:
pd.value_counts(obj.to_numpy())

C:\Users\박주하\AppData\Local\Temp\ipykernel_7952\4037610489.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy())

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [31]:
pd.value_counts(obj.to_numpy(), sort=False)

C:\Users\박주하\AppData\Local\Temp\ipykernel_7952\164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [32]:
pd.value_counts(obj.to_numpy(), ascending=True)

C:\Users\박주하\AppData\Local\Temp\ipykernel_7952\3730876187.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), ascending=True)

d    1
b    2
c    3
a    3
Name: count, dtype: int64

In [33]:
obj.value_counts(ascending=True)

d    1
b    2
c    3
a    3
Name: count, dtype: int64

In [34]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [35]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [36]:
obj.value_counts(sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [37]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [41]:
1 in obj
9 in obj
#'c' in obj

False

In [45]:
obj[obj.isin(['b','c'])]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [46]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [47]:
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [48]:
unique_vals = pd.Series(["c", "b", "a"])
unique_vals

0    c
1    b
2    a
dtype: object

In [49]:
pd.Index(unique_vals)

Index(['c', 'b', 'a'], dtype='object')

In [50]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [51]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [52]:
# 데이터프레임, 행렬
# 공통점 : 2차원
# 차이점 : 행렬(모든 자료의 타입이 동일), 데이터프레임(모든 자료의 타입이 동일/비동일, 각 열은 동일 타입)

In [55]:
#리스트, 벡터(1차원)
#myList=[1,'a',2.1,True]
# np.array([1,'a'])

array([1. , 2.1])

In [56]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [58]:
data['Qu1'].value_counts()

Qu1
3    2
4    2
1    1
Name: count, dtype: int64

In [59]:
data['Qu1'].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [60]:
data
#모든 열 단위로 각 숫자의 빈도수를 출력하시오.

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [61]:
data.value_counts()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64

In [62]:
data[:].value_counts()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64

In [63]:
data[:].value_counts().sort_index()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64

In [65]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [64]:
data['Qu1'].value_counts()

Qu1
3    2
4    2
1    1
Name: count, dtype: int64

In [66]:
# def f1(x): #f1함수에 각각의 열들이 하나씩 전달
#     return x.max()-x.min()
# frame.apply(f1) #frame에 열 단위로 f1함수를 적용해라

In [72]:
import warnings 
warnings.filterwarnings(action='ignore')

In [75]:
#data
#빈도표(각 데이터가 해당 열에서 등장한 빈도수로 나타낸 테이블)
# def aaa(x):
#     return x.value_counts()
# data.apply(aaa)
    
data.apply(pd.value_counts)

data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [76]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [77]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64

In [78]:
# a,b,c,d,message
# 1,2,3,4,hello
# 5,6,7,8,world
# 9,10,11,12,foo
df=pd.read_csv("data/examples/ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [81]:
#!cat data/examples/ex1.csv

'cat'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [ ]:
# 1,2,3,4,hello
# 5,6,7,8,world
# 9,10,11,12,foo

In [83]:
df=pd.read_csv("data/examples/ex2.csv", header=None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [84]:
df=pd.read_csv("data/examples/ex2.csv", header=None, names=['a','b','c','d','msg'])
df

   a   b   c   d    msg
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [86]:
df=pd.read_csv("data/examples/ex2.csv", header=None, names=['a','b','c','d','msg'], index_col='msg')
df
#index_col : 특정 열의 값을 행 인덱스 라벨로 설정

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [87]:
# key1,key2,value1,value2
# one,a,1,2
# one,b,3,4
# one,c,5,6
# one,d,7,8
# two,a,9,10
# two,b,11,12
# two,c,13,14
# two,d,15,16
pd.read_csv("data/examples/csv_mindex.csv")

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [91]:
df=pd.read_csv("data/examples/csv_mindex.csv", index_col=['key1','key2'])
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
#             A         B         C
# aaa -0.264438 -1.026059 -0.619500
# bbb  0.927272  0.302904 -0.032399
# ccc -0.264273 -0.386314 -0.217601
# ddd -0.871858 -0.348382  1.100491

In [102]:
df=pd.read_csv("data/examples/ex3.txt", sep="\s+")
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [99]:
df.loc[1]

            A         B         C    bbb  0.927272  0.302904 -0.032399
Name: 1, dtype: object

In [ ]:
# # hey!
# a,b,c,d,message
# # just wanted to make things more difficult for you
# # who reads CSV files with computers, anyway?
# 1,2,3,4,hello
# 5,6,7,8,world
# 9,10,11,12,foo

In [106]:
df=pd.read_csv("data/examples/ex4.csv", skiprows=[0,2,3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# something,a,b,c,d,message
# one,1,2,3,4,NA
# two,5,6,,8,world
# three,9,10,11,12,foo

In [107]:
df=pd.read_csv("data/examples/ex5.csv")
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [112]:
df=pd.read_csv("data/examples/ex5.csv").fillna("NULL")
df
df=pd.read_csv("data/examples/ex5.csv").fillna("AAA")
df
#fillna는 데이터의 누락값 또는 NA 등을 읽어올때 특정 값으로 대체할 때 사용하는 함수

  something  a   b     c   d message
0       one  1   2   3.0   4     AAA
1       two  5   6   AAA   8   world
2     three  9  10  11.0  12     foo

In [113]:
pd.read_csv("data/examples/ex5.csv")

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [114]:
df=pd.read_csv("data/examples/ex5.csv",na_values=["world"])
df
#na_values는 리스트에 담긴 특정 문자(열)에 해당되는 데이터에 대해 결측값으로 읽어지도록 하는 옵션

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8     NaN
2     three  9  10  11.0  12     foo

In [116]:
df=pd.read_csv("data/examples/ex5.csv", na_values=['9'])
df

  something    a   b     c   d message
0       one  1.0   2   3.0   4     NaN
1       two  5.0   6   NaN   8   world
2     three  NaN  10  11.0  12     foo

In [118]:
df=pd.read_csv("data/examples/ex5.csv", na_values=['9','10','?'])
df

  something    a    b     c   d message
0       one  1.0  2.0   3.0   4     NaN
1       two  5.0  6.0   NaN   8   world
2     three  NaN  NaN  11.0  12     foo

In [119]:
df=pd.read_csv("data/examples/ex5.csv")
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [126]:
df=pd.read_csv("data/examples/ex5.csv", na_filter=False)
df

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [128]:
df=pd.read_csv("data/examples/ex5.csv", na_filter=True)
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [129]:
df=pd.read_csv("data/examples/ex5.csv")
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [132]:
df=pd.read_csv("data/examples/ex5.csv", na_values=['one', 'foo'])
df

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [134]:
df=pd.read_csv("data/examples/ex6.csv")
df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     10000 non-null  float64
 1   two     10000 non-null  float64
 2   three   10000 non-null  float64
 3   four    10000 non-null  float64
 4   key     10000 non-null  object
dtypes: float64(4), object(1)
memory usage: 390.8+ KB

In [147]:
# 부족한 메모리, 빅 데이터 읽기 방법
# 1) 큰 메모리를 구매
# 2) 분산 환경 구성
# 3) 빅 데이터를 쪼개서 읽어들인다(우리의 방법)

# chksize=1000 #한 번에 1천개씩 데이터 읽기

# for cnt, chunk in enumerate(pd.read_csv("파일명", chunksize=chksize)):
#     처리작업(chunk)
    
chker=pd.read_csv("data/examples/ex6.csv", chunksize=1000)
type(chker)

pandas.io.parsers.readers.TextFileReader

In [148]:
chker

In [150]:
chker=pd.read_csv("data/examples/ex6.csv", chunksize=1000)
for piece in chker:
    print(piece['key'].value_counts())
    print("="*50)

key
S    48
O    44
F    40
H    39
Q    39
J    39
G    38
R    38
X    37
I    37
V    35
U    33
D    32
E    32
W    31
L    31
K    31
A    30
M    29
Y    28
T    27
N    27
C    27
Z    26
B    25
P    25
7    17
6    17
4    17
3    15
8    13
1    13
2    11
9    11
0     9
5     9
Name: count, dtype: int64
==================================================
key
O    48
L    44
X    40
I    39
R    38
F    37
Q    35
D    34
V    33
K    33
E    32
H    31
J    31
T    31
A    31
U    30
N    30
Z    30
M    28
S    27
Y    27
G    26
P    26
W    25
B    24
C    23
5    20
0    19
9    19
8    19
4    18
1    16
3    16
2    14
6    14
7    12
Name: count, dtype: int64
==================================================
key
A    40
O    40
X    39
E    39
M    38
H    37
T    36
G    36
K    34
L    34
U    33
F    32
B    32
N    31
V    31
S    30
P    30
Z    29
W    29
J    29
D    28
R    28
Q    28
Y    27
C    27
I    25
6    20
0    19
9    19
7    18
3    15
2    14
4    14
8    14
5    14
1    11
Name: count, dtype: int64
==================================================
key
X    43
J    41
V    38
Q    38
D    38
C    37
E    37
N    36
P    35
B    35
F    35
L    33
S    32
K    32
R    31
A    31
M    30
H    30
O    29
Y    28
W    28
I    28
G    27
U    26
Z    24
T    23
5    21
6    18
3    17
1    16
2    16
0    15
9    15
8    13
4    12
7    12
Name: count, dtype: int64
==================================================
key
E    54
Q    42
L    40
H    39
P    38
K    38
M    36
X    35
Y    35
D    34
W    33
U    33
N    33
I    31
T    31
Z    31
F    31
A    31
G    30
B    27
V    26
O    26
C    26
J    25
S    24
2    20
4    18
R    18
0    18
3    18
5    17
6    17
8    16
7    13
9     8
1     8
Name: count, dtype: int64
==================================================
key
Y    42
F    41
K    41
X    38
V    37
L    35
W    35
E    35
J    34
M    33
R    33
P    32
N    32
U    32
I    32
D    31
S    31
B    30
G    28
H    28
Q    27
O    26
A    25
1    25
C    25
T    24
Z    23
5    22
9    20
7    20
6    17
8    17
3    16
4    13
2    12
0     8
Name: count, dtype: int64
==================================================
key
L    41
C    41
Z    39
W    39
X    38
O    37
I    36
T    36
R    35
H    34
J    33
N    32
G    31
D    31
F    31
P    30
E    30
B    30
V    30
U    29
M    29
Q    28
8    25
Y    24
A    23
K    22
7    22
S    21
9    20
0    18
4    18
2    17
1    16
5    15
3    11
6     8
Name: count, dtype: int64
==================================================
key
J    42
M    40
X    39
E    39
D    39
A    38
V    38
G    37
P    35
Q    35
R    34
L    34
H    34
B    34
Y    33
I    33
O    32
U    30
N    29
T    28
K    27
F    26
S    26
C    26
W    25
Z    22
6    21
4    19
8    18
2    16
7    14
0    14
3    13
5    13
1    12
9     5
Name: count, dtype: int64
==================================================
key
O    42
U    41
S    40
A    39
V    37
E    35
T    35
P    35
J    34
K    34
M    34
Q    34
I    33
Z    33
Y    32
W    32
B    32
R    29
F    29
D    28
N    27
X    27
C    26
H    25
L    24
G    24
7    22
4    21
9    18
1    17
2    17
3    15
0    14
6    12
8    12
5    11
Name: count, dtype: int64
==================================================
key
K    42
M    41
U    39
Y    38
P    38
E    35
R    34
Q    34
I    33
T    33
H    33
F    33
B    33
A    32
Z    31
G    31
L    30
N    29
S    29
J    29
C    28
W    28
X    28
3    26
D    25
V    23
6    22
4    21
O    19
0    17
2    15
9    15
8    15
5    15
7    14
1    12
Name: count, dtype: int64
==================================================

In [151]:
#ex6.csv의 key 열에 대해 문자별 빈도수를 출력하시오.

chker=pd.read_csv("data/examples/ex6.csv", chunksize=1000)
for piece in chker:
    print(piece['key'].value_counts())
    print("="*50)

key
S    48
O    44
F    40
H    39
Q    39
J    39
G    38
R    38
X    37
I    37
V    35
U    33
D    32
E    32
W    31
L    31
K    31
A    30
M    29
Y    28
T    27
N    27
C    27
Z    26
B    25
P    25
7    17
6    17
4    17
3    15
8    13
1    13
2    11
9    11
0     9
5     9
Name: count, dtype: int64
==================================================
key
O    48
L    44
X    40
I    39
R    38
F    37
Q    35
D    34
V    33
K    33
E    32
H    31
J    31
T    31
A    31
U    30
N    30
Z    30
M    28
S    27
Y    27
G    26
P    26
W    25
B    24
C    23
5    20
0    19
9    19
8    19
4    18
1    16
3    16
2    14
6    14
7    12
Name: count, dtype: int64
==================================================
key
A    40
O    40
X    39
E    39
M    38
H    37
T    36
G    36
K    34
L    34
U    33
F    32
B    32
N    31
V    31
S    30
P    30
Z    29
W    29
J    29
D    28
R    28
Q    28
Y    27
C    27
I    25
6    20
0    19
9    19
7    18
3    15
2    14
4    14
8    14
5    14
1    11
Name: count, dtype: int64
==================================================
key
X    43
J    41
V    38
Q    38
D    38
C    37
E    37
N    36
P    35
B    35
F    35
L    33
S    32
K    32
R    31
A    31
M    30
H    30
O    29
Y    28
W    28
I    28
G    27
U    26
Z    24
T    23
5    21
6    18
3    17
1    16
2    16
0    15
9    15
8    13
4    12
7    12
Name: count, dtype: int64
==================================================
key
E    54
Q    42
L    40
H    39
P    38
K    38
M    36
X    35
Y    35
D    34
W    33
U    33
N    33
I    31
T    31
Z    31
F    31
A    31
G    30
B    27
V    26
O    26
C    26
J    25
S    24
2    20
4    18
R    18
0    18
3    18
5    17
6    17
8    16
7    13
9     8
1     8
Name: count, dtype: int64
==================================================
key
Y    42
F    41
K    41
X    38
V    37
L    35
W    35
E    35
J    34
M    33
R    33
P    32
N    32
U    32
I    32
D    31
S    31
B    30
G    28
H    28
Q    27
O    26
A    25
1    25
C    25
T    24
Z    23
5    22
9    20
7    20
6    17
8    17
3    16
4    13
2    12
0     8
Name: count, dtype: int64
==================================================
key
L    41
C    41
Z    39
W    39
X    38
O    37
I    36
T    36
R    35
H    34
J    33
N    32
G    31
D    31
F    31
P    30
E    30
B    30
V    30
U    29
M    29
Q    28
8    25
Y    24
A    23
K    22
7    22
S    21
9    20
0    18
4    18
2    17
1    16
5    15
3    11
6     8
Name: count, dtype: int64
==================================================
key
J    42
M    40
X    39
E    39
D    39
A    38
V    38
G    37
P    35
Q    35
R    34
L    34
H    34
B    34
Y    33
I    33
O    32
U    30
N    29
T    28
K    27
F    26
S    26
C    26
W    25
Z    22
6    21
4    19
8    18
2    16
7    14
0    14
3    13
5    13
1    12
9     5
Name: count, dtype: int64
==================================================
key
O    42
U    41
S    40
A    39
V    37
E    35
T    35
P    35
J    34
K    34
M    34
Q    34
I    33
Z    33
Y    32
W    32
B    32
R    29
F    29
D    28
N    27
X    27
C    26
H    25
L    24
G    24
7    22
4    21
9    18
1    17
2    17
3    15
0    14
6    12
8    12
5    11
Name: count, dtype: int64
==================================================
key
K    42
M    41
U    39
Y    38
P    38
E    35
R    34
Q    34
I    33
T    33
H    33
F    33
B    33
A    32
Z    31
G    31
L    30
N    29
S    29
J    29
C    28
W    28
X    28
3    26
D    25
V    23
6    22
4    21
O    19
0    17
2    15
9    15
8    15
5    15
7    14
1    12
Name: count, dtype: int64
==================================================

In [153]:
tot=pd.Series([], dtype='int64') #빈 시리즈 정의, 정수가 저장될 수 있음
tot

Series([], dtype: int64)

In [154]:
ser1=pd.Series([10,20])
ser1

0    10
1    20
dtype: int64

In [157]:
#tot+ser1
tot.add(ser1, fill_value=0)

0    10.0
1    20.0
dtype: float64

In [158]:
chker = pd.read_csv('data/examples/ex6.csv',chunksize=1000)
tot = pd.Series([], dtype='int64')
for piece in chker:
    tot = tot.add(piece.key.value_counts(), fill_value=0)
print(tot)

key
0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [159]:
chker = pd.read_csv('data/examples/ex6.csv',chunksize=1000)
tot = pd.Series([], dtype='int64')
for piece in chker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
print(tot)

key
0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [160]:
tot.sort_values(ascending=False)

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
V    328.0
I    327.0
U    326.0
P    324.0
D    320.0
A    320.0
R    318.0
Y    314.0
G    308.0
S    308.0
N    306.0
W    305.0
T    304.0
B    302.0
Z    288.0
C    286.0
4    171.0
6    166.0
7    164.0
8    162.0
3    162.0
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
dtype: float64

In [165]:
chker = pd.read_csv('data/examples/ex6.csv',chunksize=1000)
tot = pd.Series([], dtype='int64')
for piece in chker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
print(tot)

key
0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [ ]:
# "a","b","c"
# "1","2","3"
# "1","2","3"

In [171]:
df=pd.read_csv("data/examples/ex7.csv")
df
df.columns
df.index
df.values

array([[1, 2, 3],
       [1, 2, 3]], dtype=int64)

In [172]:
import csv

In [174]:
reader=csv.reader(open("data/examples/ex7.csv"))

In [175]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [176]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [177]:
import json

In [178]:
res=json.loads(obj) #obj에 저장된 딕셔너리 구조의 문자열을 읽어서 json 형식으로 변환하여 res에 저장
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [179]:
type(res)

dict

In [180]:
type(obj)

str

In [181]:
asjson=json.dumps(res) #res에 저장된 딕셔너리 구조의 데이터를 문자열로 저장
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [182]:
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [183]:
res['siblings']

[{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
 {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]

In [184]:
pd.DataFrame(res['siblings'])

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [ ]:
# [{"a": 1, "b": 2, "c": 3},
#  {"a": 4, "b": 5, "c": 6},
#  {"a": 7, "b": 8, "c": 9}]

In [185]:
data=pd.read_json("data/examples/example.json") #json -> data frame
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [187]:
#data frame -> csv
data.to_csv("data_to_csv.csv")

In [188]:
data.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [189]:
data.to_json("data_to_json.json")

In [191]:
tables=pd.read_html("data/examples/fdic_failed_bank_list.html")
len(tables)

1

In [192]:
tables[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
...,...,...,...,...,...,...,...
542,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
543,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
544,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
545,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
546,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [193]:
pd.read_excel("data/examples/ex1.xlsx")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [194]:
pd.read_excel("data/examples/ex1.xlsx", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [195]:
pd.read_excel("data/examples/ex1.xlsx", index_col=0) #Sheet1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [196]:
pd.read_excel("data/examples/ex1.xlsx", index_col=0, sheet_name="Sheet1") #Sheet1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [199]:
df=pd.read_excel("data/examples/ex1.xlsx", index_col=0, sheet_name="Sheet2") #Sheet2

In [200]:
df

   q   w   e   r message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [201]:
df.to_excel("ex1_copy.xlsx",sheet_name="Mysheet1")